<?php

// Оголошення функції deletesymbols, яка приймає рядок (ім'я файлу) і повертає модифікований рядок (ім'я файлу без спеціальних символів) та його розширення.
function deletesymbols(string $filename) : string
{
    // Визначення шаблону для видалення всіх неалфанумеричних символів
    $pattern = '/[\W]/';

    // Отримання інформації про файл (ім'я та розширення)
    $info = pathinfo($filename);
    $name = $info['filename'];              // Ім'я файлу без розширення
    $extension = $info['extension'];        // Розширення файлу

    // Видалення неалфанумеричних символів з імені файлу
    $name = preg_replace($pattern, '', $name);

    // Повернення модифікованого імені файлу та його розширення, розділеного точкою та пробілом
    return $name . " . " . $extension;
}

?>

