<?php

// Оголошення функції getfiles, яка приймає рядок (шлях до каталогу) і повертає масив імен файлів або false, якщо не вдалося отримати файли.
function getfiles(string $dir) : array|false
{
    // Отримання поточного робочого каталогу та формування повного шляху до каталогу, переданого як параметр.
    $path = getcwd().DIRECTORY_SEPARATOR.$dir;
    // Отримання масиву імен файлів та каталогів, що знаходяться у вказаному каталогу.
    $arr = scandir($path);
    // Видалення з масиву значень ".", "..", що вказують на поточний та батьківський каталоги.
    $arr = array_diff($arr, array('.', '..'));
    // Повернення масиву імен файлів, виключаючи "." та "..", або false, якщо не вдалося отримати файли.
    return $arr;
}
?>
