<?php

// Оголошення функції з назвою "translit", яка приймає один параметр типу string і повертає строку.
function translit(string $filename) : string
{
    // Оголошення масиву, який містить таблицю транслітерації.
    // Ключами є символи українського алфавіту, а значеннями — їхні відповідники у латинському алфавіті.
    $transliterationTable = [
        'а' => 'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'h',
        'ґ' => 'g',
        'д' => 'd',
        'е' => 'e',
        'є' => 'ie',
        'ж' => 'zh',
        'з' => 'z',
        'и' => 'y',
        'і' => 'i',
        'ї' => 'i',
        'й' => 'i',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'kh',
        'ц' => 'ts',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'shch',
        'ь' => '',
        'ю' => 'iu',
        'я' => 'ia',
    ];

    // Перетворення всіх символів у вхідному рядку ($filename) до нижнього регістру за допомогою mb_strtolower
    // та заміна символів згідно з таблицею транслітерації за допомогою strtr.
    $filename = strtr(mb_strtolower($filename), $transliterationTable);

        // Повернення транслітерованого рядка

